Repository: jonatasdemello/GWBasicComputerGames
Catalog: coding-horror/basic-computer-games/08_Batnum/csharp/Properties/Resources.*.resx
Languages: fr

# COMPTURN
source: COMPUTER TAKES {0} AND LEAVES {1}
fr: L'ORDINATEUR PREND {0} ET LAISSE {1}

# END_COMPLOSE
source: COMPUTER TAKES {0} AND LOSES
fr: L'ORDINATEUR PREND {0} ET PERD

# END_COMPWIN
source: COMPUTER TAKES {0} AND WINS
fr: L'ORDINATEUR PREND {0} ET GAGNE

# END_DRAW
source: ITS A DRAW, THERE ARE ONLY {0} PIECES LEFT
fr: MATCH NUL, IL RESTE SEULEMENT {0} PIECES

# END_PLAYERLOSE
source: TOUGH LUCK, YOU LOSE.
fr: PAS DE CHANCE. TU AS PERDU.

# END_PLAYERWIN
source: CONGRATULATIONS, YOU WIN.
fr: BRAVO! TU AS GAGNE

# INPUT_ILLEGAL
source: ILLEGAL MOVE, RENETER IT
fr: CE COUP EST INTERDIT. RE-ESSAIE

# INPUT_TURN
source: YOUR MOVE ?
fr: TON TOUR ?

# INPUT_ZERO
source: I TOLD YOU NOT TO USE ZERO! COMPUTER WINS BY FORFEIT.
fr: JE TE DIS DE NE PAS UTILISER LE ZERO! L'ORDINATEUR GAGNE PAR DEFAUT.

# INTRO_PART1
source: THIS PROGRAM IS A 'BATTLE' OF NUMBERS GAME, WHERE THE COMPUTER IS YOUR OPPONENT
fr: CE PROGRAMME EST UN JEU 'BATAILLE' DE NOMBRES, OU L'ORDINATEUR EST TON ADVERSAIRE

# INTRO_PART2
source: THE GAME STARTS WITH AN ASSUMED PILE OF OBJECTS. YOU AND YOUR OPPONENT ALTERNATELY REMOVE OBJECTS FROM THE PILE. WINNNING IS DEFINED IN ADVANCE AS TAKING THE LAST OBJECT OR NOT. YOU CAN ALSO SPECIFY SOME OTHER BEGINING CONDITIONS. DON'T USER ZERO, HOWWEVER, IN PLAYING THE GAME.
fr: LE JEU COMMENCE AVEC UNE NOMBRE D'OBJETS DEFINI. TOI ET TON ADVERSAIRE ENLEVEZ EN ALTERNANCE UN NOMBRE D'OBJETS. LES CONDITIONS DE VICTOIRE SON DÉFINIES À L'AVANCE COMME PRENDRE OU NE PAS PRENDRE LE DERNIER OBJET. VOUS POUVEZ ÉGALEMENT PRÉCISER D'AUTRES CONDITIONS DES LE DÉBUT. TOUTEFOIS, N'UTILISEZ PAS LE CHIFFRE ZERO.

# START_QUESTION_DRAWMINMAX
source: ENTER MIN AND MAX ?
fr: ENTRE LE MINIMUM ET MAXIMUM D'OBJETS A RETIRER POUR CHAQUE TOUR ?

# START_QUESTION_PILESIZE
source: ENTER PILE SIZE ?
fr: ENTRE LE NOMBRE D'OBJETS ?

# START_QUESTION_WHOSTARTS
source: ENTER START OPTION - 1 COMPUTER FIRST, 2 YOU FIRST ?
fr: ENTRE QUI COMMENCE - 1 L'ORDINATEUR, 2 TOI ?

# START_QUESTION_WINOPTION
source: ENTER WIN OPTION - 1 TO TAKE LAST, 2 TO AVOID LAST: ?
fr: ENTRE LA CONDITION DE VICTOIRE - 1 PRENDRE LA DERNIERE PIECE, 2 EVITER LA DERNIERE PIECE ?
